Dissertacao/graphs/proxy/throughput.txt

#load-test (the maximum number of users)

#weighttp -n 2000000 -t 25 -c 100 -k proxy:10000/index.html
#./wrk -t12 -c200 -d30s http://proxy:9000/index.html

#no proxy, no load balancer
"a" 64320 3.24

#load balancer only
"b" 62000 3.34

#proxy only
"c" 34384 5.67

#LB and proxy without log
"d" 30720 6.83

#LB and proxy
"e" 29040 9.70



#  12 threads and 200 connections
#direct
#  Thread Stats   Avg      Stdev     Max   +/- Stdev
#    Latency     3.24ms    3.10ms  71.51ms   92.75%
#    Req/Sec     5.36k     0.85k   11.67k    78.82%


#haproxy
#  Thread Stats   Avg      Stdev     Max   +/- Stdev
#    Latency     3.34ms    5.92ms   1.02s    97.32%
#    Req/Sec     5.17k   762.22     9.11k    77.54%
#  1753551 requests in 30.00s, 1.99GB read
#Requests/sec:  58459.82 Transfer/sec:     67.85MB



#shuttle direct
#  Thread Stats   Avg      Stdev     Max   +/- Stdev
#    Latency    15.67ms  109.29ms   1.59s    99.26%
#    Req/Sec     2.70k   733.46     5.89k    73.94%
#  918950 requests in 30.00s, 1.06GB read
#Requests/sec:  30636.30



#shuttle with load balancer
#Thread Stats   Avg      Stdev     Max   +/- Stdev
#    Latency     9.70ms   27.05ms 468.28ms   98.90%
#    Req/Sec     2.43k   517.75     4.27k    76.54%
#  836331 requests in 30.00s, 0.95GB read
#  Socket errors: connect 0, read 8, write 0, timeout 0
#Requests/sec:  27881.47 Transfer/sec:     32.36MB



#without logging with LB
#Running 30s test @ http://proxy:9000/index.html
#  12 threads and 200 connections
#  Thread Stats   Avg      Stdev     Max   +/- Stdev
#    Latency     6.83ms    7.45ms 248.91ms   99.29%
#    Req/Sec     2.56k   340.96     4.86k    82.62%
#  879038 requests in 30.00s, 1.00GB read
# Requests/sec:  29304.77 Transfer/sec:     34.01MB

#without logging with LB
#  Thread Stats   Avg      Stdev     Max   +/- Stdev
#    Latency     7.05ms    6.46ms 226.26ms   99.11%
#    Req/Sec     2.53k   396.80     4.44k    80.53%
#  861052 requests in 30.00s, 0.98GB read
# Requests/sec:  28705.01 Transfer/sec:     33.32MB